[
  [
    "Hello everyone,\n This is a reminder that Cambridge One has quizzes that are due at the end of this week.\n\nhttps://www.cambridgeone.org/\n Edward",
    "Hello everyone, \n\nI have updated the Cambridge One homework assignments with Units 18-21. \nThe deadline is December 7th. \n The assignment has four units, so I will give you 2 weeks to complete this assignment. \n -Edward",
    "Hello everyone,\n The online video with the textbook and the Cambridge One quiz has been updated for this week. Please do the homework this week.\n If you did not complete all of the units in the textbook, or if you were absent in last class, please bring your textbook this week with all of the pages done with the online videos.\nYou can find all the previous videos here:\nhttps://www.edwardtesol.com/stem-rw--ls.html",
    "Please bring your textbooks to class this week!",
    "Hello everyone,\n I have uploaded the next online video for you to watch this week and do the textbook activities.\n\nAlso, please check the Cambridge One quizzes for this week.\n\nI will also check your textbooks this week, so please make sure you have completed the past textbook activities with the online videos. You can find the past videos here:\n\nhttps://www.edwardtesol.com/stem-rw--ls.html\n Please complete all the pages!",
    "Hello everyone,\n I have updated the homework for Week 11. It is due November 15th. \n 1. \nPlease check Cambridge One for the writing review quizzes.\nhttps://www.cambridgeone.org/\n 2. \nAnd please check the HUFS e-class for the online video with the textbook (Unit 3, Chapter 6)\n ** I will check your textbooks in next class, so please make sure you have done the previous videos and textbook pages up to Chapter 5.",
    "Here is information about the reading source presentations for week 9 and week 10.\n You can find the files and information here: https://www.edwardtesol.com/stem-rw--ls.html\n Information: Download File\n Reading skills: Download File Download File Download File\n Some notes:\nYou do need to attend both weeks. (Support your classmates!!)\nYou can use a script or notes, but don't let it negatively affect your presentation quality. \nYou can bring your presentation file on USB stick or download from email or cloud folder. I will give time to prepare at the start. Maybe keep an extra file in your email just in case. \nYou can use websites, links, online services etc. to demonstrate or show things as well. (For example showing an AI service). You can use video clips, sounds, objects, and whatever else to make your presentation more interesting.\nUse AI to help you prepare. This assignment is designed for you to utilize AI.\nInclude your ideas, opinions, and experiences as well. \nAfter the presentations, I will collect your PPT file or a summary of your presentation (1 page). Please include a link to your readings in the PPT, or you can submit a summary with the links.\n Here is the schedule (this is not the order for each week)\n Friday 31 October \n 신혜성\n한가연\n한승우\n오예령\n박규리\n권윤오\n Friday 7 November \n 최은율\n박영재\n박주영\n변종민\n이동현\n박은혜\n서원덕",
    "Hello all,\n I hope you had a nice Chuseok.\n We do have regular class today at 3pm (sorry! - university policy).\n Please don't forget to bring a reading source to discuss today. \nSee the previous notice for information.",
    "This notice has a list of sources (in pink) and a list of example topics (in blue).\n Midterm Assignment\nFor the Midterm Assignment, you will do a presentation based on at least 2 reading sources.\nhttps://www.edwardtesol.com/uploads/2/6/5/8/26581579/midterm_presentations_info_and_guide.pdf\n\nThe homework for next class is to choose, read, and bring one reading source to discuss. The source can be from a report, research paper, book, essay, reliable website, or article. See the list of source options in pink.\n You can choose any topic. I suggest choose something you are interested in and related to your major. Try to be specific. See topic examples below in blue. \n Here is a list of places to find reading sources.\nAcademic Papers & Journals\nGoogle Scholar – Great for finding papers; sometimes links to free PDFs.\nSemantic Scholar – AI-powered search with many open-access papers.\narXiv – Preprints in computer science, AI, physics, and more.\nDirectory of Open Access Journals (DOAJ) – Free, peer-reviewed journals across disciplines.\nCORE – Aggregates millions of open-access research articles.\nPubMed Central – Free access to biomedical and health-related papers.\nBooks & Texts\nInternet Archive – Millions of free books, papers, and media.\nProject Gutenberg – Free classic literature and reference books.\nOpenStax – Free, peer-reviewed textbooks (math, science, humanities).\nOAPEN Library – Open-access academic books, many in humanities and social sciences.\nPDF Drive – Search engine for free PDF books (quality varies).\nResearch Data & Statistics\nOur World in Data – Free datasets and visuals on global issues.\nKaggle – Free datasets, especially for AI and data science.\nUN Data – Official United Nations statistics.\nWorld Bank Open Data – Economic and social data worldwide.\nMore General Knowledge\nStanford Encyclopedia of Philosophy – Free, reliable philosophy/ethics reference.\nThe Conversation – Articles written by academics, free and accessible.\nPLOS ONE – Open-access scientific journal.\n Here is a list of example topics for your presentation:\n1. Programming & Technical Sides\nPython vs. Other Languages in AI: Why Python is preferred in machine learning, but how R, Julia, or C++ might be better in certain cases.\nThe Limitations of ChatGPT in Coding Help: When AI generates errors, insecure code, or outdated solutions.\nEnergy Costs of Training Models: The environmental footprint of training GPT-4 compared with Google searches.\n2. Ethics & Controversies\nAI Scraping and Copyright: The lawsuits against OpenAI and Stability AI for using books and images without permission.\nBias in AI Systems: Examples like facial recognition misidentifying people of color, or hiring algorithms filtering out women’s résumés.\nDeepfake Dangers: Political misinformation and celebrity impersonation scandals.\n3. Society & Everyday Life\nAI in Education: How students use ChatGPT for homework, and the debate about plagiarism vs. support.\nAI and Jobs: Which jobs are most likely to be replaced (e.g., call centers, translators) vs. new jobs being created (AI ethics officers, prompt engineers).\nAI in Healthcare: How AI diagnoses cancers earlier than doctors, but also the risks of misdiagnosis.\nAI in Social Media: Recommendation algorithms shaping what we see on TikTok, YouTube, or Instagram.\n4. Future & Philosophy\nSelf-Driving Cars: Why Tesla’s Autopilot struggles in some conditions; should humans or AI take final control?\nCan AI Be Creative?: Comparing an AI-generated painting or song with a human artist’s work.\nThe “Black Box” Problem: Why we can’t always explain how deep learning models make decisions.\nAI for Global Challenges: Using AI to predict climate patterns or discover new medicines.\n5. Broader Tech Topics (linked to AI)\nCybersecurity Risks with AI: Hackers using AI to generate phishing emails or fake voices.\nBlockchain + AI: Using blockchain to verify AI-generated content.\nOpen-Source vs. Closed AI: Stability AI’s open models vs. OpenAI’s closed ones — what’s better for innovation?\nThe Carbon Footprint of Data Centers: Comparing AI model training to airline emissions.",
    "Homework for Week 5 \n Deadline\nThursday class: October 2\nFriday class: October 10\n 1. Choose and read one source for your presentation and bring it to class (printed or digital link/file). Be ready to discuss and explain the source in groups.\n2. Do the Cambridge One quiz.\n3. Watch the e-class video and do the activities in the textbook.\n You can find the information about the midterm project assignment here:\nhttps://www.edwardtesol.com/stem-rw--ls.html",
    "I have added \"Assignment 2\" and \"Assignment 3\" to Cambridge One. \nEach assignment covers one unit. \n https://www.cambridgeone.org/\n The deadline is next week. \n\nDon't forget to complete the assignments for this week!!",
    "Hello everyone!\n\nI received a message that the online video set for homework has an issue. It looks ok on my system, but if there is a problem with it, please let me know by message or in the next class, and I will fix the issue. Occasionally, there could be technical issues or problems with the links or settings. If that's the case, I will be flexible about the assignment and try to resolve the issue for the next class. \n\nThanks!",
    "Hello everyone,\n I have assigned the homework on Cambridge One. The deadline is set for next week.\n However, not all students have joined yet. \n Please join if you haven't yet!\n\nEdward",
    "The textbook audio will be included in the online videos, but if you need to listen multiple times you can use the files linked here. \n Here is the link for the Academic Encounters textbook audio and video files:\nhttps://drive.google.com/drive/folders/1TGL4BsIchtajLBnEMbP31nYT_QT4GJpG?usp=sharing \n These files can be used for homework assignments with the textbook.",
    "Homework for Week 3 \n Buy the textbook: Academic Encounters \nWatch the e-class video and do the activities in the textbook.\n Sign up to www.cambridgeone.org\nClass joining code \n(use the right one!):\nThursday class: J98n-9Gym\nFriday class: uwKq-Gvb4\n Do the Cambridge One quiz (it will be opened when all students join and the deadline will be extended to give everyone a chance to do it).\n  edwardtesol@gmail.com",
    "Hello everyone,\n This is information for week 2. There are two things to do:\n 1. Buy the textbook for this class. \nAcademic Encounters Reading and Writing Level 1 Student's Book (2nd edition)\n Image: https://contents.kyobobook.co.kr/sih/fit-in/400x0/pdt/9781107683631.jpg\n 2. Join Cambridge One \nhttps://www.cambridgeone.org/\nSee the PDF file guide \"STEM RW WEEK 1 F2025\" linked below to help you join.\nThe code to join our class is: uwKq-Gvb4 \n Please do these before next class (week 2) if you can.\n See you next week!\n첨부파일(1개)\n- STEM RW WEEK 1 F2025.pdf (4.9MB)",
    "Hello!\n\nThe Academic Encounters textbooks are available in the small bookshop which is inside the HUFS Cyber building (near main gate).\n\n\nEdward"
  ],
  [
    "12/2 수업은 휴강입니다. 대신 12/9에 정상수업 하도록 하겠습니다.",
    "중간고사 점수 통계를 아래와 같이 공지합니다.\n평균: 52.50\n표준편차: 19.93",
    "다음과 같이 중간고사를 공지합니다.\n 일시: 10월 21일 09:00 - 10:30 (90분)\n장소: 교수학습개발원 108호\n범위: 강의자료\n\n시험은 지정된 장소에서 공용PC를 사용하여 온라인으로 진행됩니다.\n개인 PC를 사용하거나 외부에서 시험을 응시하는 것은 불가능합니다."
  ],
  [
    "시험탭에서 중간고사 성적을 확인하실 수 있습니다. (금요일 밤까지)\n해설 및 부분점수 채점기준은 첨부한 ppt 파일을 확인해주세요.\n본인 점수에 이의가 있는 학생은 제 메일(seungtaek.choi@hufs.ac.kr)로 문의 남겨주시기 바랍니다. (금요일 밤까지)\n첨부파일(1개)\n- oop-midterm-explanation.pptx (2.8MB)",
    "객체지향프로그래밍 과목의 중간고사 일정을 아래와 같이 공지합니다.\n- 일시: 10월 22일 수요일\n  - 입실: 13:00 ~ 13:05\n  - 시험: 13:05 - 14:50 (총 105분 풀이)\n- 장소: 교수학습개발원 108호 (기존 강의실)\n- 방식: 강의실 (오프라인 필수) 에서 e-Class 시험 기능 (온라인 응시)\n 필수 안내 사항\n- 실습실 컴퓨터에서 시험을 치르셔야 합니다. (개인 노트북 사용 불가)\n- 브라우저 외 프로그램 실행 금지입니다. (IDE, 터미널, 메신저, 외부 저장장치 등 사용 불가)\n- 코드를 실행하거나, 인터넷 검색을 하거나, AI를 활용하는 등의 행위는 금지입니다. \n- 빈 A4 용지 지참 가능  # 공책 및 노트는 불가합니다.\n- 학생증 또는 신분증을 지참해주세요. \n- 답안지 제출 전에는 중도 퇴실이 불가합니다. (화장실 포함)\n- 부정행위 적발 시 해당 시험 0점 처리 후 학사 규정에 따라 조치하도록 하겠습니다.\n 문의: seungtaek.choi@hufs.ac.kr",
    "2차 과제 데드라인을 아래와 같이 연장합니다.\n- 데드라인: 10월 10일 (금요일) 저녁 11시 59분까지 제출\n- 과제 기한이 연장되는 만큼, 학생들 간의 PR 리뷰가 의무입니다. 최소 1명 이상의 다른 학생 PR에 리뷰를 남겨야 합니다. \n  - 특별한 경우를 제외하면, 이미 학생한테 리뷰를 받은 PR 외에 다른 PR을 리뷰해주세요.\n  - 리뷰를 받은 학생은 리뷰에 적극적으로 대응해주세요.\n  - 모범적인 리뷰들을 선정해서 participation 점수에도 반영할 예정입니다. \n- 그리고, 이 과목을 수강하면서 생성형AI (ChatGPT/Gemini) 를 활용하여 공부하고 문제를 해결하는 것은 첫 주에 얘기하였듯 굉장히 장려하는 바이나, 무분별하게 생성형AI를 활용해 과제를 처리하는 것은 권장되지 않습니다. 생성형AI의 도움을 받아서 작성한 부분에 대해서 명확히 표기하고, 외부 자료 (위키피디아/블로그/논문/오픈소스 등) 를 참고한 경우, 그게 무엇이 됐든 출처를 명확히 하여주시기 바랍니다. 이를 명확히 표기하지 않을 시 불이익을 받을 수 있습니다.",
    "오늘 수업 중에 안내가 된 것처럼, 2차 과제가 나왔습니다.\n- 과제 링크: https://github.com/HUFS-LAI-Seungtaek/HUFS-LAI-OOP-2025-2/tree/main/assignments/assignment2\n- 데드라인: 10월 3일 (다음주 금요일) 저녁 11시 59분까지 제출\n  - 1차 과제도 마찬가지지만, approve 되지 않은 PR은 0점 처리 예정입니다. \n  - 기본적인 구현을 완료한 경우 PR을 approve 할 예정입니다. \n  - 이번 과제는 채점기를 돌려서 평가할 예정이고, 몇몇 케이스를 통과하지 못 하면 부분점수가 부여됩니다. \n    - 과제 스펙대로 구현하면 웬만해선 만점이 나올 겁니다.\n    - 과제를 일찍 제출한다면 통과하지 못 한 케이스들에 대해서는 리뷰로 안내할 예정입니다. \n    - 리뷰가 달리면 메일이 올텐데, 반드시 메일을 확인해주세요. 과제를 제출하고 0점 받는 상황을 조심해주시기 바랍니다. 메일을 확인하지 않아서 생기는 상황은 본인 책임입니다. \n 아래는 기타 안내사항 입니다.\n- assignments 아래에서 코드를 수정하는 것이 아니라, assignments 에서 제공된 코드를 submissions 에 복사해놓고, submissions 에서 코드를 수정한 후 제출하는 것입니다. \n- 오늘 수업 중이나 과제를 진행하면서 도움을 받았다면 PR description에 명시해주세요. 도움을 준 학생들에겐 participation 점수를 부여할 예정입니다.\n- 과제를 빨리 완료한 학생들은 다른 학생들이 제출한 PR 을 리뷰해주세요. 적절한 리뷰를 작성해준 학생들에게도 participation 점수를 부여할 예정입니다. \n- 오늘 실습때 받았던 질문들을 토대로 과제 수행 방법 안내 부분을 개선할 예정입니다만, 아무래도 시간이 좀 걸릴 수 있는 점 양해 바랍니다. \n 마지막으로...\n파이썬, Git/GitHub, 거기에 터미널 (cmd) 까지 안 익숙한 것들을 한번에 다뤄야 하는 과제이기 때문에 많이 낯설고 어려울 수 있다는 점 충분히 알고있습니다. 이런 상황에서 직접 공부하고, 도움을 요청하고, 질문을 할 수 있는 것 또한 하나의 능력입니다. 만약 과제 진행이 어렵다면, 게시판에 글을 작성하셔도 되고, GitHub Issues 에 질문을 올리셔도 되고, 저를 찾아와서 질문하셔도 되니 언제든 질문하고 도움 요청하길 바랍니다.",
    "1차 과제 제출 기한을 금요일 (9월 19일) 밤 11시 59분 까지로 연장하도록 하겠습니다.\n 2주차 강의자료에 적혀있듯이, 1차 과제의 제출 기한은 원래 어제 밤 (11:59 PM at Sep 16)  까지였으나... \n제가 과제 스펙을 명확하게 적어놓지 않기도 했고, 여러분에게 익숙하지 않은 제출 방식인 점을 고려하여 기한을 연장하는게 좋을 것 같습니다. \n다만, 이미 과제를 제출한 학생들과의 형평성을 고려하여, 어제까지 과제를 approve 받지 못 한 학생들은 업데이트된 assignment1 스펙을 참고하여 과제를 진행해주길 바랍니다. 업데이트된 assignment1 스펙은 아래 링크에서 확인하실 수 있습니다. 자기소개의 내용과 양은 체크하지 않겠지만, 최소한의 markdown 문법 (타이틀 #과 리스트 -, 코드는 ` 혹은 ```) 을 숙지할 수 있도록 스펙을 업데이트 했으니, 스펙을 다시 확인하고 PR을 업데이트 해주기 바랍니다. \n assignment1: https://github.com/HUFS-LAI-Seungtaek/HUFS-LAI-OOP-2025-2/tree/main/assignments/assignment1 \n 감사합니다.",
    "- 첫번째 과제가 나왔습니다. 오늘 강의에서 다룬 내용대로 https://github.com/HUFS-LAI-Seungtaek/HUFS-LAI-OOP-2025-2 에 여러분들의 자기소개를 올리는 것입니다. 강의 자료에는 다른 repository의 스크린샷도 활용했기 때문에, HUFS-LAI-OOP-2025-2 인 걸 반드시 확인해주시길 바랍니다. 만약 어려움이 있다면 다른 학생들이 어떻게 제출했는지 참고해보는 것도 좋습니다. (https://github.com/HUFS-LAI-Seungtaek/HUFS-LAI-OOP-2025-2/pulls?q=sort%3Aupdated-desc+is%3Apr)\n- 강의자료에 적혀있는 것과는 별개로, 제가 과제가 나왔다고 명시적으로 공지사항에 글을 적었을 때부터 과제가 있구나 라고 생각해주시면 됩니다.",
    "- 수강변경 기간이기 때문에 출석 체크를 진행하지 않았습니다. (전원 출석처리 했습니다.)\n- 다음 수업까지 GitHub (https://github.com/) 계정 생성을 완료해주세요. 과제 제출 등 여러 목적으로 강의에서 쓰일 예정입니다."
  ],
  [
    "[제14주차 강의안내]\n 1. 강의 안내\n주차 강의는 “스토아학파의 삶의 기술과 치유”라는 주제로 장영란의 『좋은 삶이란 무엇인가』의 일부를 다룹니다. 강의노트 PDF파일 첨부합니다. 강의자료 유출되지 않도록 유의바랍니다.\n 2. 토론문제\n미네르바 인문강좌(2)와 관련하여 1) 강의 중에 나왔던 고전 텍스트 중에서 가장 좋았던 고전의 구절과 그 이유를 말하며 생각을 나눠보고, 현 교재에는 없지만 앞으로 포함되었으면 좋으리라 생각하는 고전텍스트를 1권 제시해보자. 2) 강의 중에 가장 어려웠던 주장이나 논의를 1-2가지를 조별로 협의하여 결정한 후에 함께 분석하고 해결해보고, 3) 나아가 이번 학기 미네르바 강의와 관련해서 간단한 소회를 함께 나눠봅시다.\n(조별로 발표하지 않은 학생들은 해당일에 모두 발표하시길 바랍니다)\n  첨부파일(1개)\n- 0 특강-스토아 [노트PDF] 삶의 기술과 치유-장영란.pdf (322.8KB)",
    "[13주차 강의안내와 노트]\n 1. 강의 안내\n제13주차 강의는 “과학기술과 트랜스휴머니즘”이라는 주제로 후쿠야마와 닉 보스트룸, 그리고 마이클 샌델과 앨런 뷰캐넌의 저작들을 다룹니다. 강의노트 PDF파일 첨부합니다. 강의자료 유출되지 않도록 유의바랍니다.\n 2. 토론문제\n오늘은 예고한 대로 토론 없습니다. \n기험시험과 관련된 안내를 합니다. 오늘 외에 다른 안내는 없습니다.\n*기말시험과 관련된 언급은 개인적으로 하지 않습니다. \n첨부파일(1개)\n- 5-0 과학기술과 트랜스휴먼-[노트PDF] 장영란.pdf (160.3KB)",
    "[2025-2] 기말시험 안내 및 문제분석\n장영란입니다. 미네르바 인문강좌를 수강하느라 한 학기 동안 고생 많으셨습니다. 기말시험 준비를 위한 문의에 빠른 답변을 위해 미리 기말시험과 관련하여 안내 공지를 올립니다. 기말시험은 한 학기 동안 여러분이 공부한 내용을 정리하는 시간이니 차분하게 임해주시면 고맙겠습니다. 이미 공지했듯이 기말시험에 대한 행정적인 질문 외에는 받지 않습니다. 현재 진행중인 강의 내용을 이해하기 위한 질문은 무기명 처리하고 답변을 만들어 Q&A에 공개적으로 올리는 것을 양해해주시길 바랍니다.\n 1. 시험일시와 장소\n 1) 일시: 2025년 12월 10일 수요일 19:00-20:30(*제1주 강의안내에서 확정공지했습니다)\n2) 장소: 인문관 2층 대강당\n3) 시험방식과 준비\n*대면 시험, 논술형(1-2개), 약술형(3개) 출제\n-강의 내용에 관해 미리 서술형으로 정리해놓을 필요가 있습니다. 미리 준비가 되지 않으면 시간 내에 ‘충분히’ 작성할 수 없는 문제가 나갑니다.\n-강의주제에 대한 정확한 이해 평가+ 강의주제에 대한 응용 및 적용 능력 평가\n 2. 시험 범위\n 1. 수사학-설득의 기술\n2. 향연-eros\n3. 니코마코스 윤리학 8-9권: philia\n4. 시학\n5. 기술복제 시대의 예술작품\n6. 과학기술과 트랜스휴머니즘\n7. 스토아학파의 삶의 기술\n [기말시험 진행 유의사항]\n 1) 시험시간 중에 외부출입 불가합니다. 일단 시험 장소를 벗어나면 다시 입장 불가하니 모든 외무 용무는 시험 전에 처리하시길 바랍니다. 인원이 많아 개인적 용무를 따로 해결해 드릴 수 없는 점 양해 바랍니다.\n2) 시험시간에 핸드폰(off)을 비롯한 모든 전자기기와 이어폰/헤드폰 및 귀마개 사용을 금지합니다. 즉각 퇴장 및 시험지 무효처분이 됩니다.\n3) 필기도구 외에는 모두 가방 속에 넣어주시길 바랍니다. 시험 문제지 뒷면을 연습장으로 활용할 수 있습니다.\n4) 시험시간에 부정행위는 0점 처리가 되니 유혹되지 않으시길 바랍니다. 그외 시험시간에 잠을 자거나 이어폰을 끼는 행위는 금지하며 퇴실 후 자유로운 시간을 보내도록 합니다.\n5) 미리 허락을 얻은 경우가 아니면 시험 시작하고 10분이 지난 후에는 입실할 수 없으며, 40분이 지난 이후에 퇴실 가능합니다.\n(*기말시험을 치르면서 다른 사람에게 피해를 주거나 불편을 주지 않도록 배려하고, 각자 최선을 다하여 좋은 결과를 얻으시길 바랍니다.)",
    "[제12주차 강의안내]\n *갑자기 황반원공 진단을 받아 긴급수술을 해서 한쪽이 잘 보이지 않고 어른거려서 안대를 착용하고 강의할 수 있습니다. 양해바랍니다.\n1. 강의 안내\n*12주차 강의는 “발터 벤야민의 대중예술론”이라는 주제로 발터 벤야민의 『기술복제시대의 예술작품』(길)를 다룹니다.\n강의노트 PDF파일 첨부합니다. 강의자료 유출되지 않도록 유의바랍니다.\n 2. 토론문제\n※교재에 나온 문제들 약간 수정한 것입니다.\n1. 발터 벤야민의 대중예술론을 기반으로 현대 한국 대중예술의 특징과 대중문화산업의 영향력과 관련하여 제시될 수 있는 문제점들을 검토하고 대안에 대해 논의해보시오.\n2. [심화문제]오늘날은 인공지능(AI) 시대라고 부를 만큼 우리 삶과 사회 전반에 걸쳐 갈수록 그 영향력이 커지며 가장 큰 화두로 떠오르고 있다. 인공지능 기술의 다양한 발전을 통하여 인간의 삶 전반에 걸친 새로운 문화가 형성되고 있다. 특히 예술 분야에서도 새로운 시도가 이루어지고 있는데, 인공지능도 인간 못지않게 스스로 생각하고 창조적으로 예술품을 만들어내고 있다. 음악을 작곡하고, 미술 작품을 창작하고, 시와 소설을 쓰고 과학소설을 쓰는 등 인공지능 예술창작의 다양한 예시를 찾아 논의해 보자. 그와 더불어 인공지능 예술의 작품 창작 과정이나 저작권, 그리고 그 작품성은 어떠한지 생각해 보자.\n  첨부파일(1개)\n- 4-3 벤야민 [노트PDF]-기술복제-장영란.pdf (172KB)",
    "일부 수업에 동영상 마감 일자가 오류가 있어 수정했습니다.\n모두 11월19일(수) 마감이니 반드시 시청하기 바랍니다.\n동영상 재오픈없으니 문의하지 않기를 바랍니다.",
    "[10주차 강의안내] (11월4/5일)\n 1. 강의 안내\n*10주차 강의는 “안티고네의 법과 사랑”이라는 주제로 소포클레스의 『안티고네』를 다룹니다.\n-11월 4일(화)/5일(수) 강의대체 동영상으로 ‘출석 인정기간’ 내에 들어야 출석으로 인정됩니다.\n 2. 강의 노트\n강의노트 PDF파일 첨부합니다. 강의자료 유출되지 않도록 유의바랍니다.\n 2. 강의시간 조정\n1. 출석인정 마감시간 반드시 확인하시길 바랍니다. 동영상은 다시 오픈하지 않으니 문의하지 않기를 바랍니다.\n2. 출석인정시간은 정상속도보다 빠르게 ‘약’ 1.4배속으로 들을 수 있도록 조정했습니다. 아주 천천히 듣고 싶은 학생들은 정상속도 1배속으로 들으셔도 되지만 혼자 녹음하다 보니 많이 느리게 말하고 있으니, 약간 빠르게 1.25배속으로 들으셔도 되고, 조금 더 빨리 듣고 싶은 학생은 약 1.4배속으로 들으시면 됩니다. 그렇지만동영상 강의를 듣고 수업을 100% 이수했는지 이클래스의 출석에서 반드시 확인하시길 바랍니다.\n첨부파일(1개)\n- 4-0 [노트PDF] 소포클레스-안티고네-장영란.pdf (212.8KB)",
    "[9주차 강의안내]\n 1. 강의 안내\n주차 강의는 “아리스토텔레스의 비극의 정의와 본질”이라는 주제로 아리스토텔레스의 『시학』을 다룹니다.\n강의노트 PDF파일 첨부합니다. 강의자료 유출되지 않도록 유의바랍니다.\n 2. 토론문제\n1. 각 조별*로 관심있는 작품**을 1가지 선택하여 아리스토텔레스가 비극을 정의하면서 말한 1) 비극적 감정인 ‘연민’과 ‘공포’가 여실하게 드러난 장면을 설명해보고, 2) 반전과 인지라 할 수 있는 부분을 근거를 제시하며 논의해보자.\n2. 각 조별로 관심있는 작품을 1가지 선택하여 아리스토텔레스의 비극의 정의와 최선의 플롯에 적합한 조건들에 따라 분석하고 논의해보자.\n*각 사람별로도 가능함.\n**문학, 영화, 그림, 춤 등 포함\n첨부파일(1개)\n- 4-1 아텔-시학[노트PDF]-장영란.pdf (166.7KB)",
    "[11주차 강의안내]\n 1. 강의 안내\n*11주차 강의는 “헨리 소로의 자연과 삶의 진실”이라는 주제로 헨리 소로의 『월든』을 다룹니다.\n-11월 11일(화)/12일(수) 강의대체 동영상으로 ‘출석 인정기간’ 내에 들어야 출석으로 인정됩니다.\n *동영상 마감 11월19일(출석인정, 재시청불가) \n2. 강의 노트\n강의노트 PDF파일 첨부합니다. 강의자료 유출되지 않도록 유의바랍니다.\n 2. 강의시간 조정\n1. 출석인정 마감시간 반드시 확인하시길 바랍니다. 동영상은 다시 오픈하지 않으니 문의하지 않기를 바랍니다.\n2. 출석인정시간은 정상속도보다 빠르게 ‘약’ 1.4배속으로 들을 수 있도록 조정했습니다. 아주 천천히 듣고 싶은 학생들은 정상속도 1배속으로 들으셔도 되지만 혼자 녹음하다 보니 많이 느리게 말하고 있으니, 약간 빠르게 1.25배속으로 들으셔도 되고, 조금 더 빨리 듣고 싶은 학생은 약 1.4배속으로 들으시면 됩니다. 그렇지만동영상 강의를 듣고 수업을 100% 이수했는지 이클래스의 출석에서 반드시 확인하시길 바랍니다. (총길이 약100분, 실시간60.8분  1. 20:16, 2.20;25 3. 16;43, 4.23.25 5.21:31)\n첨부파일(1개)\n- 11주 헨리소로(노트)-월든-장영란.pdf (511KB)",
    "[11월 1주와 2주 동영상 강의 안내 및 변경사항]\n강의1주차에 안내해드렸듯이 11월 1주와 2주 강의는 출장으로 동영상 강의로 진행됩니다.\n동영상 강의와 관련하여 기존 공지에서 안내해드린 둘 중 하나의 텍스트와 주제가 수정 및 변경 사항이 있습니다. “사랑과 우정” 관련 주제가 많아서 푸코의 <성의 역사>를 헨리 소로의 <월든>으로 대체하려 합니다. 동영상 강의 시청은 중간시험기간 전후로 순차적으로 올리겠습니다.\n동영상 업데이트가 되면 다시 공지하겠습니다.\n<변경사항>\n1) 제10주 (11월4,5일)\n3. 사랑과 우정: 소포클레스의 <안티고네>\n2) 제11주 (11월11,12일)\n6. 생명과 환경: 헨리 소로의 <월든>",
    "1. 2차보고서 마감일 공지\n1) 일시:2025년 10월 29일(수) 23시59분 \n2) 분량: A4한글 3쪽 이상(표지, 참고문헌 제외한 쪽수)\n            워드 글자수 5000천자이상(참고문헌포함)입니다.\n*제출:2차 [과제]방+ 튜터( *류두진 djryu_trans@naver.com )\n*메일형식: 화456장-김영희-2차, 수456장-김영희-2차, 수789장-김영희-2차\n**반드시 튜터에게 피드백을 받아야 최소한으로 형식에 관한 감점을 줄일 수 있습니다.\n 2. 2차보고서 교수피드백신청\n2차보고서는 양이 많기 때문에 피드백 인원을 2-3명으로 제한합니다.\n1) 신청일자: 2025년 10월14일~ (선착순 마감)\n*제한 인원이 차면 시간제한 때문에 메일을 보낸 경우도 피드백이 어렵다는 것을 양해해주길 바랍니다.\n2) 피드백 일자: 10월 28, 29일\n11월 첫째주와 둘째주 출장으로 동영상 강의로 대체되어서 보고서 마감 후에 하는 것이 어렵습니다\n따라서 10월 27일까지 미리 접수할 수 있는 학생들의 보고서로 피드백합니다.\n3) 신청형식: 먼저 신청하고 확정되면 10월27일까지 마지막 원고를 보내시면 됩니다.\n보고서 안에서 이름을 지우시고 보내주시길 바랍니다.",
    "[7주차 강의안내]\n 1. 강의 안내\n7주차 강의는 “필리아: 사랑 또는 우정”이라는 주제로 아리스토텔레스의 『니코마코스』, 마테오 리치의 『교우론』, 마르티노 마르티니의 『구우론』을 다룹니다.\n강의노트 PDF파일 첨부합니다. 강의자료 유출되지 않도록 유의바랍니다.\n 2. 토론문제\n1. 플라톤의 <향연>에서 사랑에 관한 신화들 중 세 가지를 활용하여 자신이 생각하는 에로스관에 대해 설명한 후 팀별로 새로운 사랑의 신화를 만들어 상징과 이미지를 통해 분석해보시오.\n2. 아리스토텔레스가 제시하는 필리아의 정의와 종류 및 원리 등을 검토하여 각자 생각하는 가장 이상적인 필리아는 무엇인가를 논의해보자. 나아가 현대사회에 나타나는 다양한 종류의 필리아에 대해 검토하여, 현대인들에게 바람직한 필리아는 무엇인지를 이야기 해보자.\n3. 아리스토텔레스가 말하는 정치적 필리아의 필요성과 중요성에 대해 논의해보고, 현대사회의 정치 상황과 연관하여 좀더 확대된 개념이나 이론을 팀별로 아이디어를 내서 논의해보자\n   첨부파일(1개)\n- 3-2 아텔-[통합노트PDF] 필리아-장영란 (교우론,구우론).pdf (556.4KB)",
    "[6주차 강의안내]\n 1. 강의 안내\n제6주차 강의는 “플라톤의 에로스의 신화와 철학”이라는 주제로 플라톤의 『향연』을 다룹니다.\n-10월 7, 8일 추석연휴 공휴일 보강 동영상수업입니다.\n-‘출석 인정기간’ 내에 들어야 출석으로 인정됩니다.\n 2. 강의 노트\n강의노트 PDF파일 첨부합니다. 강의자료 유출되지 않도록 유의바랍니다.\n 2. 강의시간 조정\n1. 출석인정 마감시간 반드시 확인하시길 바랍니다.\n※동영상은 다시 오픈하지 않으니 문의하지 않기를 바랍니다.\n2. 출석인정시간은 정상속도보다 빠르게 ‘약’ 1.4배속으로 들을 수 있도록 조정했습니다(동영상 실제시간보다 약40% 정도 출석인정시간을 줄여서 올렸습니다. 아주 천천히 듣고 싶은 학생들은 정상속도 1배속으로 들으셔도 되지만 혼자 녹음하다 보니 많이 느리게 말하고 있으니, 약간 빠르게 1.25배속으로 들으셔도 되고, 조금 더 빨리 듣고 싶은 학생은 약 1.4배속으로 들으시면 됩니다. 그렇지만동영상 강의를 듣고 수업을 100% 이수했는지 이클래스의 출석에서 반드시 확인하시길 바랍니다.\n   첨부파일(1개)\n- 3-1 플라톤-[노트PDF 향연-장영란.pdf (157.3KB)",
    "[5주차 강의안내]\n 1. 강의 안내\n주차 강의는 “타인의 고통과 이미지”이라는 주제로 수전 손택의 『타인의 고통』을 다룹니다.\n강의노트 PDF파일 첨부합니다. 강의자료 유출되지 않도록 유의바랍니다.\n 2. 토론문제\n다음과 같은 방식으로 진행합니다. 이번주 팀조정이 있으니 자신의 조를 다시 확인하시길 바랍니다.\n1. 자료: 사진예술 작품이나 자신의 갤러리 사진 등 \n2. 내용  자신이 보았던  사진들 중에서 가장 인상깊었었거나, 또는 자신의 삶에서 중요한 계기가 된 사진을 소개하고, 핵심적인 주제를 가지고 자신의 생각을 설명한다. (각 조원들은 각 발표에 대한 비슷한 경험들을 간략하게 이야기를 나눈다)\n3. 방법: 1) 개인별로 준비하여 발표할 수도 있고,\n        2) 조별로 특정한 주제를 정해서 논의할 수도 있다.\n(전쟁, 사랑, 우정, 대학, 청소년시절, 혐오 등)\n첨부파일(1개)\n- 2-2 수전 손택-[노트PDF] 타인의 고통-장영란.pdf (515.6KB)",
    "1주차에 설명했던 것처럼\n1차보고서 샘플 피드백을 다음주에 합니다.\n선착순으로 4명 정도 하려하니 장영란 phileidos@naver.com 로\n메일 제목 [요일-시간-이름-1차피드백신청] 으로 해서\n보고서 파일 첨부해서 신청바랍니다. \n* 만약 부족한 경우에는  임의로 선택합니다.\n . 수789마감. 화456마감.수123마감 완료",
    "[4주차 강의안내] 『』\n 1. 강의 안내\n4주차 강의는 “맥루언의 미디어 이론”이라는 주제로 맥루언의 『미디어의 이해』를 다룹니다.\n강의노트 PDF파일 첨부합니다. 강의자료 유출되지 않도록 유의바랍니다.\n *( 튜터 *류두진 rdj850@nate.com )\n 2. 토론문제\n1. 기본문제\n미디어 기술(technology)이 발전함에 따라 ‘소셜미디어’라는뉴 미디어의 형태가 등장하게 되었고, 올드미디어의 시절과 비교했을 때 사람들간의소통 방식 자체가 어떻게 변화했을까? 개인 간의 소통, 비지니스 커뮤니케이션, 그리고 사회문화적 상호작용 등 ‘인간관계의 디지털화’에대한 다양한 예시들을 생각해보고 토의해보자.\n2. 심화문제\nAI 기술이 어떻게 문화적 변화(문화 산업, 소비 패턴 및 미디어와 문화생태계 등)를 가속화하고 이와 관련된 윤리적 문제들은 무엇이 있는지 토의해보자.\n3. 응용문제\n다양한 미디어를 통하여 우리 삶에 어떤 변화가 있었는지를 맥루한의논의와 연속성 상에서 논의해보자.\n첨부파일(1개)\n- 2-1 맥루언-[노트PDF] 미디어의 이해-장영란.pdf (447.9KB)",
    "제3주 강의안내 및 강의노트\n 1. 강의 안내\n주차 강의는 “키케로의 연설의 종류와 기술”이라는 주제로 키케로의 『수사학』을 다룹니다.\n강의노트 PDF파일 첨부합니다. 강의자료 유출되지 않도록 유의바랍니다.\n  2. 토론문제\n*조별로 수업관련내용으로 토론주제를 만들어와도 됩니다.\n1. 우리가 일상생활에서 설득을 하기 위해 가장 좋은 방법이라 생각하는 것들을 사례와 함께 이야기 나누고 가장 좋은 것이라 판단되는 방법을 다수결로 뽑아보자\n2. 아리스토텔레스/키케로의 설득의 세 요소를 가지고 문학, 역사, 철학 등 작품의 사례에 적용해보자.\n3. 아리스토텔레스/키케로의 수사학적 방법을 가지고 신문, 광고, 인스타그램, 유튜브 등 매중 매체에 나타나는 사례를 가지고 설명해보자\n*자신이 속한 조는 팀프로젝트에서 확인하시길 바랍니다. \n첨부파일(1개)\n- 1-3 키케로PTF [노트] 수사학-장영란.pdf (832.5KB)",
    "1. 강의 안내\n2주차 강의는 “아리스토텔레스의 설득의 기술”이라는 주제로 아리스토텔레스의 『수사학』을 다룹니다. 강의노트 PDF파일 첨부합니다.\n  2. 강의 진행\n수사학 강의\n중간보고서 글쓰기\n1) 글쓰기 작성방법\n2) AI 활용 글쓰기 윤리지침\n 2. 토론문제\n*글쓰기 강의로 정식으로 토론을 진행할 수 없을 듯합니다.\n*조편성은 팀프로젝트에 들어가서 확인하시면 됩니다.\n *AI 활용 글쓰기 윤리지침(노트)는 미네르바중간보고서 글쓰기에 새로 첨부합니다.\n*강의노트(수정240824)  재첨부합니다.\n첨부파일(1개)\n- 1-2 아텔PTF [강의]-수사학-장영란.pdf (433KB)",
    "미네르바 중간보고서 작성은 학술적 글쓰기 형식으로 해야 합니다.\n1학기에 대부분 작성한 경험이 있겠지만, 각 교수님에 따라 요구하는 것이 \n달라질 수 있습니다. \n더욱이 1학기보고서를 학술적 글쓰기 형식으로 작성하지 않았다면 반드시 확인해보셔야 합니다. \n 첨부파일에 핵심적인 내용을 정리해두었으니 필독바랍니다.\n1) 보고서 작성방법\n2) 1차보고서 사례\n3) 보고서 샘플\n첨부파일(4개)\n- 0 2025-2 미네르바글쓰기 작성방법-장영란.pdf (211.2KB)\n- 0 2 장영란 미네르바 1차보고서 글쓰기 사례-2학기.pdf (128.1KB)\n- 0 2 (샘플) 세네카의 운명과 덕의 훈련-장영란-한국여성철학31권2019.pdf (651.4KB)\n- 0 AI사용 글쓰기 윤리지침-장영란.pdf (79.3KB)",
    "안녕하세요. 2025년 2학기 미네르바 인문강좌를 여러분과 함께 하게 된 장영란입니다.\n 1) 1주차 강의는 강의 안내와 수업 방식 및 보고서 작성에 대해 안내합니다.\n미네르바 인문강좌는 동일강좌이지만 각 교수님의 전공이나 관심에 따라 텍스트 선택이나 세부내용이 다릅니다. 세부 강의계획서를 통해 이번 학기 강의에 대해 구체적으로 알려드립니다. 첨부된 세부강의 계획서를 확인해주시길 바랍니다. \nhttp://minerva-college.hufs.ac.kr/\n 2) 세부 강의계획서 PDF파일로 첨부합니다.\n 3) 외국인학생은 필수 과목이 아닙니다. \n*높은 수준의 듣기, 말하기, 쓰기 능력이 필요한 과목이니 가능한 한국어가 능숙한 학생은 수강하시고, 아니면 3,4학년이 되어 한국어에 능숙해지시면 수강하셔도 됩니다.  \n첨부파일(1개)\n- 0 2025-2 개정 미네르바 세부 강의계획서-장영란(3).pdf (189.8KB)"
  ],
  [
    "<과제> 섹션에서 기말고사 확인하세요.\n중간고사 때처럼 <과제> 섹션에 업로드 하면 됩니다. \n 우리는 이미 보강수업을 동영상으로 했기 때문에 \n종강은 12월1일 입니다.",
    "여러분 과제 낸 곳에서 점수 확인하세요.\n 상중하 정도로만 나누었어요 \n 점수에 대한 코멘트 듣고 싶은 학생은 저한테 수업 시간 후에 \n글 가지고 와서 물어보세요. \n 말로 설명해주는 게 훨씬 효과적이어서\n듣고 싶은 학생은 그렇게 하면 좋겠습니다~\n 기말 점수에 따라서 \n지금의 점수는 얼마든지 뒤집힐 수 있어요!\n너무 슬퍼하거나 ^^;;; 기뻐하지 말고\n기말까지 건강하게 화이팅!",
    "추석 휴강에 대한 보강 동영상을 <6주차>에 올렸습니다.\n출석체크도 되고 시청기한은 11월9일까지 넉넉하니\n꼭 그 전에 보길 바랍니다. \n 학기 말 보강주간에 보강하지 않고 \n차라리 그 시간에 기말레포트에 집중하는 게 나을 것 같아서 \n동영상으로 보강합니다. \n 내용은 3대 예술론 중 하나인 <형식주의>이고, \n우리 수업 계획상 11월10일에 다루려고 했는데,\n<형식주의>는 수업 진도와 상관없이 독립적으로도 이해되기 때문에\n여러분이 이건 집에서 보고오면 좋겠습니다. \n그럼 11월10일부터는 다른 예술론들을 보도록 할게요. \n 11월9일까지 꼭 보고 오세요!",
    "<과제>에서 중간고사 확인하세요!\n 제출은 10월20일 월요일까지이고, \n 이 날은 휴강합니다.",
    "결석해서 출석 인정 받고 싶으면\n 미리 저한테 연락하지 않아도 됩니다. \n 결석한 후 다음 수업할 때 관련 서류를 프린트해서 가져오면 됩니다. \n(2-3주 지나도 괜찮음/ 이메일로는 안받습니다)"
  ],
  [
    "이번주 보강기간에 진행될 11강 나머지 및 12강 수업은 온라인 강의로 업로드 예정입니다.\n 별도로 오프라인 수업이 진행되지 않을 예정이니 주의바랍니다.\n 기말고사 시험은 기존 안내대로 12월 17일 수요일 오후 6시에 기존 강의실에서 진행될 예정이니 참고바랍니다.\n시험범위는 중간고사 이후~12강까지 출제예정입니다.\n 질문이 있는 경우 쪽지나 메일로 문의 바랍니다.",
    "일시: 12월 17일 수요일 저녁 6시\n장소: 사회과학관 3502 (수업 강의실)",
    "지난시간 공지한대로 다음주 월요일 11/10 수업은 휴강입니다.\n11/17에 만나요",
    "중간고사는 지난번 공지한 대로 수요일 저녁 6시입니다.\n 시험 일자: 10/22 수요일 \n시험 시간: 오후 6시~8시 2시간\n시험 장소: 사회과학관 502호 (기존 강의실)\n 필기도구 이외의 모든것을 허용되지 않습니다.\n시험시작 30분 이후부터 퇴실 가능.\n 컨닝 발각시 F 처리"
  ],
  [
    "12월 8일 수업안내입니다.\n진도를 모두 나가서 12월 8일 수업은 없습니다.\n 날씨가 쌀쌀하니 감기 조심하세요.\n그럼 이만",
    "안녕하세요\n10월 27일 수업 안내입니다.\n 10월 27일 수업은 동영상 강의로 대체하겠습니다.\n착오없으시기 바랍니다.\n 환절기에 감기 조심하세요.\n그럼 이만",
    "자리배치표입니다.\n [시험 유의 사항]\n1. 자리배치 확인 후 본인 자리에 앉을 것 - 신분증 책상 왼쪽 상단에 놓을 것\n2. 시험 시간동안 퇴실 불가\n3. 시험시간은 시작 후 40분동안 진행\n4. 시험지 배포/수거 시 답안 작성 금지 (펜을 들면 부정행위로 0점 처리)\n5. 시험이 종료되면 자기 줄 통로 쪽 인원에게 답안지 넘길 것\n6. 답안지에 우상단 이름 위에 본인 자리 표기 할 것\n예) A-1 \n첨부파일(2개)\n- 2025-02 컴퓨팅사고_월78_16시.pdf (81.7KB)\n- 2025-02 컴퓨팅사고_월78_15시.pdf (84.6KB)",
    "안녕하세요.\n유고결석계는 교육부 감사시 원본을 제출해야 하는 경우가 있으니 \n반드시 사인을 해서 서면으로 제출해 주시기 바랍니다.\n 환절기에 감기 조심하세요.\n그럼 이만",
    "중간고사 안내입니다.\n 일시 : 10월 20일(월) 수업시간\n범위 : 반복문까지\n시험 유형 : 주어진 코드 빈칸 완성형, 주어진 코드의 실행 결과 \n ** 10월 18일(토) 이후에 공지되는 시험 시간과 자리배치 표를 꼭 확인하시기 바랍니다.",
    "2025-2 컴퓨팅사고 코딩 존(Coding Zone) 운영 안내\n2025학년도 2학기 <컴퓨팅사고> 코딩 존을 다음과 같이 대면으로 운영합니다.\n 1. 위치\n  [서울캠퍼스]\n    코딩 존 1 : 미네르바 콤플렉스(오바마홀) 지하 1층 14호\n    코딩 존 2 : 미네르바 콤플렉스(오바마홀) 지하 1층 13호\n [글로벌캠퍼스]\n    코딩 존 1 : 인문경상관 209호\n    코딩 존 2 : 기숙사 A동 1층 컴퓨터실(엔터테인먼트 존)\n  2. 일정 : 9월 15일(월) ~ 12월 12일(금) (월~금 운영 / 주말, 공휴일, 중간고사 기간 제외)\n  [서울캠퍼스]\n    코딩 존 1 : 2~8교시 (10:00 ~ 17:00)\n    코딩 존 2 : 2~8교시 (10:00 ~ 17:00)\n  [글로벌캠퍼스]\n    코딩 존 1 : 2~8교시 (10:00 ~ 17:00)\n    코딩 존 2 : 6~12교시 (14:00 ~ 21:00)\n 3. 수업 정원 : 조교 근무 인원에 따라 8명~16명 (요일 및 교시에 따라 다름)\n 4. 진행 방식 : 50분 동안 코딩 실습과 코딩 관련 질문\n   - 50분 동안 코딩 실습에 집중하며 조교와 상호 작용 (조교에게 궁금한 점을 질의하고 응답 받기)\n   - 프로그래머스(https://www.programmers.co.kr)에서 실습 진행\n   - 코딩 존에 컴퓨터가 비치되어 있으므로 개인 노트북/태블릿 지참할 필요 없음\n 5. [중요]운영 규칙\n  가. <컴퓨팅사고> 수강생 의무 4회 참여(참여 횟수 컴퓨팅 사고 성적에 반영)\n  나. 한 회차 당 출석은 1회만 인정 : 한 회차에 2회 이상 출석해도 출석은 1회만 인정됨\n회차\n기간\n1\n9/15(월) ~ 10/10(금)\n2\n10/13(월) ~ 10/31(금)\n3\n11/3(월) ~ 11/21(금)\n4\n11/24(월) ~ 12/12(금)\n  다. 회차별 의무 참여 기간 지정 : 지정된 회차별 기간에 1회씩 출석\n  라. 예약취소 규칙 : 예약 후 ‘예약취소’ 횟수는 4회를 초과해서는 안 됨. 초과된 취소 횟수 만큼 No show 횟수로 간주함\n    (5회 취소=No show 1회, 6회 취소=No show 2회, ...로 간주 / 4회까지는 불이익 없음)\n  마. No Show 규칙 : 예약 후 예약취소를 하지 않고 코딩 존에 가지 않는 ‘No show’는 No show 횟수 만큼 전체 출석 횟수에서 차감 (예, 2회 No show 시 출석 2회 차감)\n  * No show를 만회할 수 있는 방법은 없으니, 참여를 못하는 경우 반드시 예약취소\n    (No show를 상쇄하기 동일 회차에 2회 이상 출석해도 No show가 사라지는 것이 아님)\n※ 최종 출석 횟수 계산 예시\n  1회차에 1회 출석, 2회차에 1회 출석 및 1회 노쇼, 3회차에 2회 출석, 4회차에 1회 출석한 경우 최종 출석 횟수\n   = 출석 5회 – 노쇼 1회 – 3회차 추가 출석 1회 = 총 3회\n 6. 코딩 존 예약/취소 관련\n  가. 예약 및 취소 방법 : 학교 홈페이지 -> 종합정보시스템 -> Coding Zone에서 예약 및 취소\n  나. 예약 가능 시간 : 수업 일주일 전 오전 9시 ~ 수업 시작 10분 전\n      (예. 6/10(월) 13시 수업은 6/3(월) 오전 9시 ~ 6/10(월) 12시 50분까지 예약 가능)\n  다. 예약 취소 가능 시간 : 수업 시작 1시간 전까지\n     ※ 예약 실수(날짜 및 시간 혼동)로 인한 노쇼의 책임은 학생 본인에게 있음.\n  라. 출석 인정 및 교실 입장 가능 시간 : 수업 10분 전 ~ 수업 시작 후 10분\n  마. 출석 체크 방법 : 코딩 존 입장 시 조교에게 예약 내역(이름, 학번) 확인 후 출석 체크 요청\n    ※ 수업 종료 후 반드시 종합정보시스템에서 ‘출석’으로 되어있는지 확인할 것. 수업 종료 일주일 이후 출석 처리 불가.\n  바. 한 학기 출석 횟수는 4회로 제한되어 있으므로 개인 공부를 위해 추가 실습을 원하는 학생은 별도 예약 없이 코딩 존에서 실습 가능\n  7. 기타 운영 관련 안내 사항\n  가. 1일 1회 참여 가능\n  나. 추가로 코딩 관련 질문이 있을 시 코드 트리 시스템(https://hufs.codetree.ai/ko/landing)을 이용\n  다. 코딩존 예약/출석 관련 문의 (코딩존 조교 부재 상황 포함) - 코딩 존 예약/출석 관련 문의 (코딩 존 조교 부재 상황 포함) : AI 교욱원으로 연락 바랍니다. (코딩존 행정 조교에게 연락: kimminsoo116@hufs.ac.kr, chanhyek000@hufs.ac.kr)\n  ※ 코딩 존 입구에는 아래와 같은 현판이 부착되어 있습니다.",
    "가입 후 분반을 찾을 때 사용하세요.\n https://edu.codetree.ai/hufs/invite/78Bu2DqoZrW9iaFVobYVkQ",
    "이번 주 내에 반드시 하셔야 할 일\n1. 코드트리 가입\n2. 코딩 존 예약 - 코딩 존 공간이 작아서 학생들이 몰리면 원하는 시간에 예약이 불가능 함. \n                        예약시점 확인 후 미리미리 예약해야 함\n첨부파일(1개)\n- 2024-02 컴퓨팅사고 코딩존 운영 안내.pdf (4MB)",
    "* 학생들이 사용하는 온라인 학습 및 실습 시스템:                   \n코드트리: https://hufs.codetree.ai/\n 반드시 학교 메일 계정으로 가입해야 함\n[코드트리 가입절차]\n1. 학교메일 생성. 예) xxxx.hufs.ac.kr 형태\n2. 학교메일 주소로 https://hufs.codetree.ai/ 회원 가입\n3. 구성원으로 등록되면 학습시작.(제게 승인 받아야 함) \n- 분반에 등록이 안되면 수강을 해도 출결/과제 점수가 안나감.",
    "블렌디드 러닝은 \n오프라인 강의 + 코드트리 + 코딩 존으로 운영됨\n 오프라인 강의는 매주 월요일 수업시간에 진행됨\n코드트리는 코드트리 사이트에 가입 후 지정된 기간 내에 시청 및 과제 수행\n코딩 존은 첨부된 코딩 존 운영 안내 파일 참조\n <블렌디드 러닝 성적 반영 가이드>\n* 코드트리 + 코딩 존 점수 : 30%\n- 코드트리 (온라인) 출결 + 과제 풀이 반영 : 20%\n- 코딩존 출결 점수 반영(기본 4회차에 각각 참여하여 4번 참여해야 함) : 10%\n* 오프라인 출결 10% + 중간/기말 각 30%씩"
  ]
]